In [2]:
import pandas as pd
import numpy as np
import seaborn as sb

import matplotlib.pyplot as plt # 시각화 지원
import matplotlib
matplotlib.rcParams['font.family']='Malgun Gothic'
matplotlib.rcParams['axes.unicode_minus']=False

In [6]:
# sep=',' 인자를 구분된 /, .등으로 분류해서 읽어옴
# 첫번째 로우는 컬럼명으로 지정하지 않겠다. header =None
# index_col은 앞부분 컬럼을 인덱스로 빼줌

birthDF =pd.read_csv('data/births.txt', index_col=0 )
birthDF.columns=['남아수', '여아수'] # 컬럼명 설정
birthDF.index.name='년도' # 로우명 설정
birthDF

          남아수      여아수
년도
1881    91954   100745
1882   107850   113688
1883   112321   104629
1884   129022   114445
1885   133055   107800
...       ...      ...
2007  1919408  2072139
2008  1887234  2036289
2009  1832925  1979303
2010  1772738  1913851
2011  1753500  1893230

[131 rows x 2 columns]

# 1. 남아수 총합을 구하시오
# 2. 여아수 평균을 구하시오
# 3. 남아수가 가장많은 년도와 남아수를 구하시오.
# 4. 2000년도 이후 데이터를 구하시오
# 5. 1995 ~ 2000년도 데이터를 구하시오

In [41]:
# 1. !!! 
birthDF['남아수'].sum()

161711448

In [43]:
birthDF.sum()['남아수']

161711448

In [45]:
# 2. !!!
birthDF['여아수'].mean()

1254062.6335877862

In [47]:
birthDF.mean()['여아수']

1254062.6335877862

In [59]:
# 3.
birthDF[birthDF['남아수']==birthDF['남아수'].max()]['남아수']

년도
1957    2044160
Name: 남아수, dtype: int64

In [58]:
m=birthDF['남아수'].max()
birthDF[birthDF['남아수']==m][ ['남아수'] ]

          남아수
년도
1957  2044160

In [60]:
# 4.
birthDF.loc[2000:]

          남아수      여아수
년도
2000  1814601  1962406
2001  1799049  1941251
2002  1795206  1939815
2003  1825359  1973434
2004  1834145  1982794
2005  1845379  1994841
2006  1898463  2052377
2007  1919408  2072139
2008  1887234  2036289
2009  1832925  1979303
2010  1772738  1913851
2011  1753500  1893230

In [64]:
birthDF[birthDF.index>=2000]

          남아수      여아수
년도
2000  1814601  1962406
2001  1799049  1941251
2002  1795206  1939815
2003  1825359  1973434
2004  1834145  1982794
2005  1845379  1994841
2006  1898463  2052377
2007  1919408  2072139
2008  1887234  2036289
2009  1832925  1979303
2010  1772738  1913851
2011  1753500  1893230

In [35]:
# 5.
birthDF.loc[1995:2000]

          남아수      여아수
년도
1995  1757927  1902832
1996  1752249  1893378
1997  1739806  1884122
1998  1765915  1910250
1999  1772632  1918809
2000  1814601  1962406